; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	satellite3 - satellite
	instrument5 - instrument
	satellite4 - satellite
	instrument6 - instrument
	instrument7 - instrument
	instrument8 - instrument
	satellite5 - satellite
	instrument9 - instrument
	instrument10 - instrument
	instrument11 - instrument
	satellite6 - satellite
	instrument12 - instrument
	instrument13 - instrument
	instrument14 - instrument
	satellite7 - satellite
	instrument15 - instrument
	instrument16 - instrument
	instrument17 - instrument
	satellite8 - satellite
	instrument18 - instrument
	satellite9 - satellite
	instrument19 - instrument
	instrument20 - instrument
	instrument21 - instrument
	spectrograph0 - mode
	infrared1 - mode
	thermograph2 - mode
	Star2 - direction
	Star4 - direction
	Star0 - direction
	GroundStation1 - direction
	GroundStation3 - direction
	Star5 - direction
	Star6 - direction
	Phenomenon7 - direction
	Star8 - direction
	Planet9 - direction
	Phenomenon10 - direction
)
(:init
	(supports instrument0 thermograph2)
	(supports instrument0 infrared1)
	(calibration_target instrument0 Star2)
	(supports instrument1 infrared1)
	(supports instrument1 thermograph2)
	(supports instrument1 spectrograph0)
	(calibration_target instrument1 Star2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star0)
	(supports instrument2 infrared1)
	(supports instrument2 thermograph2)
	(calibration_target instrument2 Star2)
	(supports instrument3 spectrograph0)
	(calibration_target instrument3 GroundStation3)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star5)
	(supports instrument4 thermograph2)
	(calibration_target instrument4 Star2)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star6)
	(supports instrument5 thermograph2)
	(supports instrument5 spectrograph0)
	(supports instrument5 infrared1)
	(calibration_target instrument5 Star2)
	(on_board instrument5 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star4)
	(supports instrument6 spectrograph0)
	(supports instrument6 infrared1)
	(calibration_target instrument6 GroundStation3)
	(supports instrument7 infrared1)
	(calibration_target instrument7 Star0)
	(supports instrument8 thermograph2)
	(supports instrument8 spectrograph0)
	(supports instrument8 infrared1)
	(calibration_target instrument8 Star4)
	(on_board instrument6 satellite4)
	(on_board instrument7 satellite4)
	(on_board instrument8 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Star0)
	(supports instrument9 spectrograph0)
	(calibration_target instrument9 Star0)
	(supports instrument10 infrared1)
	(calibration_target instrument10 GroundStation3)
	(supports instrument11 thermograph2)
	(calibration_target instrument11 Star0)
	(on_board instrument9 satellite5)
	(on_board instrument10 satellite5)
	(on_board instrument11 satellite5)
	(power_avail satellite5)
	(pointing satellite5 GroundStation1)
	(supports instrument12 spectrograph0)
	(supports instrument12 thermograph2)
	(supports instrument12 infrared1)
	(calibration_target instrument12 Star4)
	(supports instrument13 thermograph2)
	(calibration_target instrument13 GroundStation3)
	(supports instrument14 spectrograph0)
	(supports instrument14 thermograph2)
	(calibration_target instrument14 GroundStation3)
	(on_board instrument12 satellite6)
	(on_board instrument13 satellite6)
	(on_board instrument14 satellite6)
	(power_avail satellite6)
	(pointing satellite6 Star2)
	(supports instrument15 spectrograph0)
	(calibration_target instrument15 GroundStation3)
	(supports instrument16 thermograph2)
	(supports instrument16 infrared1)
	(supports instrument16 spectrograph0)
	(calibration_target instrument16 GroundStation3)
	(supports instrument17 thermograph2)
	(supports instrument17 infrared1)
	(calibration_target instrument17 Star0)
	(on_board instrument15 satellite7)
	(on_board instrument16 satellite7)
	(on_board instrument17 satellite7)
	(power_avail satellite7)
	(pointing satellite7 Star6)
	(supports instrument18 spectrograph0)
	(calibration_target instrument18 GroundStation1)
	(on_board instrument18 satellite8)
	(power_avail satellite8)
	(pointing satellite8 Phenomenon10)
	(supports instrument19 infrared1)
	(supports instrument19 spectrograph0)
	(supports instrument19 thermograph2)
	(calibration_target instrument19 GroundStation1)
	(supports instrument20 spectrograph0)
	(calibration_target instrument20 GroundStation3)
	(supports instrument21 infrared1)
	(supports instrument21 thermograph2)
	(supports instrument21 spectrograph0)
	(calibration_target instrument21 GroundStation3)
	(on_board instrument19 satellite9)
	(on_board instrument20 satellite9)
	(on_board instrument21 satellite9)
	(power_avail satellite9)
	(pointing satellite9 Star6)
)
(:goal (and
	(pointing satellite0 GroundStation1)
	(pointing satellite3 Star4)
	(pointing satellite9 Phenomenon10)
	(have_image Star5 infrared1)
	(have_image Star6 infrared1)
	(have_image Phenomenon7 thermograph2)
	(have_image Star8 spectrograph0)
	(have_image Planet9 spectrograph0)
	(have_image Phenomenon10 spectrograph0)
))

)

; plan
1. (turn_to satellite9 groundstation1 star6)
   deleted: (pointing satellite9 star6)
   added: (pointing satellite9 groundstation1)
   goals met: 1 of 9
2. (switch_on instrument19 satellite9)
   deleted: (power_avail satellite9)
   added: (power_on instrument19)
   goals met: 1 of 9
3. (calibrate satellite9 instrument19 groundstation1)
   added: (calibrated instrument19)
   goals met: 1 of 9
4. (turn_to satellite9 star6 groundstation1)
   deleted: (pointing satellite9 groundstation1)
   added: (pointing satellite9 star6)
   goals met: 1 of 9
5. (take_image satellite9 star6 instrument19 infrared1)
   added: (have_image star6 infrared1)
   goals met: 2 of 9
6. (turn_to satellite9 star5 star6)
   deleted: (pointing satellite9 star6)
   added: (pointing satellite9 star5)
   goals met: 2 of 9
7. (take_image satellite9 star5 instrument19 infrared1)
   added: (have_image star5 infrared1)
   goals met: 3 of 9
8. (turn_to satellite9 planet9 star5)
   deleted: (pointing satellite9 star5)
   added: (pointing satellite9 planet9)
   goals met: 3 of 9
9. (take_image satellite9 planet9 instrument19 spectrograph0)
   added: (have_image planet9 spectrograph0)
   goals met: 4 of 9
10. (turn_to satellite9 phenomenon7 planet9)
   deleted: (pointing satellite9 planet9)
   added: (pointing satellite9 phenomenon7)
   goals met: 4 of 9
11. (take_image satellite9 phenomenon7 instrument19 thermograph2)
   added: (have_image phenomenon7 thermograph2)
   goals met: 5 of 9
12. (turn_to satellite0 groundstation1 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 groundstation1)
   goals met: 6 of 9
13. (turn_to satellite9 star8 phenomenon7)
   deleted: (pointing satellite9 phenomenon7)
   added: (pointing satellite9 star8)
   goals met: 6 of 9
14. (take_image satellite9 star8 instrument19 spectrograph0)
   added: (have_image star8 spectrograph0)
   goals met: 7 of 9
15. (turn_to satellite9 phenomenon10 star8)
   deleted: (pointing satellite9 star8)
   added: (pointing satellite9 phenomenon10)
   goals met: 8 of 9
16. (take_image satellite9 phenomenon10 instrument19 spectrograph0)
   added: (have_image phenomenon10 spectrograph0)
   goals met: 9 of 9
